astb_relise/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/CommonModules/ЦенообразованиеСерверПереопределяемый/Module.bsl
Функция ПолучитьЦену(Номенклатура,Организация,Дата,Поставщик = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаЗапроса,
	               |			Организация = &Организация
	               |				И Номенклатура = &Номенклатура
	               |				И Поставщик = &Поставщик) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЗапроса",Дата);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Поставщик",?(Поставщик = Неопределено,Номенклатура.Поставщик,Поставщик));
	
	ДанныеРегистра = Запрос.Выполнить().Выгрузить();
	Если ДанныеРегистра.Количество() > 0 Тогда
		ИтогЦена = ДанныеРегистра[0].Цена;
	Иначе
		ИтогЦена = 0;
	КонецЕсли;
	Возврат ИтогЦена;
КонецФункции
